wegam/STM32F10xUSBF/FWLIB/Lib/PHY/R61509V.c
/**************************************************************************************************
* [Function] LCD_DrawDot:  画点
* [param01]t_Point StartPos: description
* [param02]u16 color: description
**************************************************************************************************/
void R61509V_DrawDotest(u16 x,u16 y, u16 color )
{
	/*
	 * t_Point endpos;
	 * u16 FWidth=1,FHeight=1;
	 * endpos.x	= StartPos.x + FWidth - 1;
	 * endpos.y	= StartPos.y + FHeight - 1;
	 */
//	if ( LCD_TRANSPARENT_COLOR != color )
//	{

		u16 HSA, HEA, VSA, VEA;
			HSA	= x;
			HEA	= x;
			VSA	= y;
			VEA	= y;
//#define Y_H	399     /*LCD_PHY_HEIGHT-1  CD_GetCfg()->PixCfg.YPixNum-1 */
//#define X_W	239     /*LCD_PHY_WIDTH-1  CD_GetCfg()->PixCfg.xPixNum-1 */

//		switch ( LCD_GetCfg()->ScrnRotat )
//		{
//		case SCREEN_ROTATE_0D:
//		{
//			HSA	= StartPos.x;
//			HEA	= StartPos.x;
//			VSA	= StartPos.y;
//			VEA	= StartPos.y;
//			break;
//		}
//		case SCREEN_ROTATE_90D:
//		{
//			HSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			HEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			VSA	= StartPos.x;
//			VEA	= StartPos.x;
//			break;
//		}
//		case SCREEN_ROTATE_180D:
//		{
//			HSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
//			HEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
//			VSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			VEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
//			break;
//		}
//		case SCREEN_ROTATE_270D:
//		{
//			HSA	= StartPos.y;
//			HEA	= StartPos.y;
//			VSA	= LCD_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
//			VEA	= LCD_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
//			break;
//		}
//		default: break;
//		}
		R61509V_WriteCMD( R61509V_R210_HSA, HSA );
		R61509V_WriteCMD( R61509V_R211_HEA, HEA );
		R61509V_WriteCMD( R61509V_R212_VSA, VSA );
		R61509V_WriteCMD( R61509V_R213_VEA, VEA );


		R61509V_WriteCMD( R61509V_R200_HA, HSA );
		R61509V_WriteCMD( R61509V_R201_VA, VSA );
		R61509V_Write_Bus( R61509V_R202_GDRW );


		R61509V_WriteData(color);

}
/**************************************************************************************************
* [Function] LCD_DrawDot:  画点
* [param01]t_Point StartPos: description
* [param02]u16 color: description
**************************************************************************************************/
void R61509V_DrawDotB( t_Point StartPos, u16 color )
{
	/*
	 * t_Point endpos;
	 * u16 FWidth=1,FHeight=1;
	 * endpos.x	= StartPos.x + FWidth - 1;
	 * endpos.y	= StartPos.y + FHeight - 1;
	 */
	if ( LCD_TRANSPARENT_COLOR != color )
	{
	#if 1
		u16 HSA, HEA, VSA, VEA;
#define Y_H	399     /*LCD_PHY_HEIGHT-1  CD_GetCfg()->PixCfg.YPixNum-1 */
#define X_W	239     /*LCD_PHY_WIDTH-1  CD_GetCfg()->PixCfg.xPixNum-1 */

		switch ( LCD_GetCfg()->ScrnRotat )
		{
		case SCREEN_ROTATE_0D:
		{
			HSA	= StartPos.x;
			HEA	= StartPos.x;
			VSA	= StartPos.y;
			VEA	= StartPos.y;
			break;
		}
		case SCREEN_ROTATE_90D:
		{
			HSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			HEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			VSA	= StartPos.x;
			VEA	= StartPos.x;
			break;
		}
		case SCREEN_ROTATE_180D:
		{
			HSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
			HEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.x-1;
			VSA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			VEA	= LCD_GetCfg()->PixCfg.YPixNum - StartPos.y-1;
			break;
		}
		case SCREEN_ROTATE_270D:
		{
			HSA	= StartPos.y;
			HEA	= StartPos.y;
			VSA	= LCD_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
			VEA	= LCD_GetCfg()->PixCfg.XPixNum - StartPos.x-1;
			break;
		}
		default: break;
		}
		R61509V_WriteCMD( R61509V_R210_HSA, HSA );			//Window Horizontal RAM Address Start (R210h),
		R61509V_WriteCMD( R61509V_R211_HEA, HEA );			//Window Horizontal RAM Address End (R211h)
		R61509V_WriteCMD( R61509V_R212_VSA, VSA );			//Window Vertical RAM Address Start (R212h),
		R61509V_WriteCMD( R61509V_R213_VEA, VEA );			//Window Vertical RAM Address End (R213h)


		R61509V_WriteCMD( R61509V_R200_HA, HSA );			//RAM Address Set (Horizontal Address) (R200h)
		R61509V_WriteCMD( R61509V_R201_VA, VSA );			//RAM Address Set (Vertical Address) (R201h)
		R61509V_Write_Bus( R61509V_R202_GDRW );
#else
		/*
		 * LCD_SetDrawWindow( StartPos, StartPos);
		 * LCD_SetGramAddress( StartPos );
		 */
#endif
		R61509V_WriteData(color);
/*
		LCD_CS_LOW;
		LCD_RD_HIGH;
		LCD_RS_HIGH;

		LCD_DATA_PORT->ODR = color;
		LCD_WR_LOW;
		LCD_WR_HIGH;
		LCD_CS_HIGH;*/
	}
}

void R61509V_EndDrawDot(void)
{
	R61509V_CS_HIGH;

}
/**************************************************************************************************
* [Function] LCD_SetGramAddress:  设置当前操作坐标点
* [param01]t_Sreen_Rotate ScrnRotat: 相对于逐行从左到右 翻转角度值
* [param02]t_PixCfg PixCfg: 显示像素配置
* [param03]t_Point point: 坐标点值
**************************************************************************************************/
void R61509V_SetGramAddress( t_Point point )
{
	u16 HA0 = 0, VA0 = 0;


	switch ( LCD_GetCfg()->ScrnRotat )
	{
	case SCREEN_ROTATE_0D:
	{
		HA0	= point.x;
		VA0	= point.y;
		break;
	}
	case SCREEN_ROTATE_90D:
	{
		HA0	= LCD_GetCfg()->PixCfg.YPixNum - point.y - 1;
		VA0	= point.x;
		break;
	}
	case SCREEN_ROTATE_180D:
	{
		HA0	= LCD_GetCfg()->PixCfg.XPixNum - point.x - 1;
		VA0	= LCD_GetCfg()->PixCfg.YPixNum - point.y - 1;
		break;
	}
	case SCREEN_ROTATE_270D:
	{	

		HA0	= point.y;
		VA0	= LCD_GetCfg()->PixCfg.XPixNum - point.x - 1;
		break;
	}
	default: break;
	}

	R61509V_WriteCMD( R61509V_R200_HA, HA0 );
	R61509V_WriteCMD( R61509V_R201_VA, VA0 );
	R61509V_Write_Bus( R61509V_R202_GDRW );
}


/**************************************************************************************************
* [Function] LCD_Setbackground:  设置背景颜色
* [param01]u16 BackColor: 背景颜色值
**************************************************************************************************/
void R61509V_Setbackground( u32 TotalPix, u16 BackColor )
{
	u32 i;

	R61509V_CS_LOW;
	R61509V_RD_HIGH;
	R61509V_RS_HIGH;

	for ( i = 0; i < TotalPix; i++ )
	{
		R61509V_DATABUS_PORT->ODR = BackColor;
		R61509V_WR_LOW;
		R61509V_WR_HIGH;
	}
	R61509V_CS_HIGH;
}


